Revit 2024 API
PipingSystemType Class
 Base class for piping system types
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class PipingSystemType : MEPSystemType
Visual Basic
Public Class PipingSystemType _
	Inherits MEPSystemType
Visual C++
public ref class PipingSystemType : public MEPSystemType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.MEPSystemType
 Autodesk.Revit.DB.Plumbing.PipingSystemType
See Also
PipingSystemType Members
Autodesk.Revit.DB.Plumbing Namespace